{"pageProps":{"postData":{"id":"no-title","contentHtml":"<p>Like most people, I’ve been finding it hard to sleep. I lay there, in bed, face up, one foot over the covers, one under, and I think about death. Not in like a sad, morbid way, but more in an objective, factual way. The fact that it exists, that it’s inevitable, that it’s final.</p>\n<p>I think that’s what scares me the most actually. The finality of it — the fact that there is nothing after. I was reminded of this the other day when I was rewatching Bojack Horseman, and there’s a scene towards the very end (spoiler) where Bojack is about to jump into a dark abyss (that represents death) and he tells his friend standing next to him that he’ll see him on the other side. In response, his friend chuckles, and shakes his said, saying, “Bojack, there is no other side. This is it.” And his friend jumps in. Bojack, frightened, attempts to run away from the abyss but to no avail. It ends up sucking him in as well.</p>\n<p>The finality of death is scary because humans spend their whole lives thinking about what’s next. I do that. I like thinking about my future and what I want to do in five years or ten years, and if it doesn’t go according to plan that’s fine. It’s just nice knowing that there is time left, there is something more to do. I read somewhere that the reason death is so scary is because we only know what it is like to live. So maybe that’s the reason, because it is simply impossible to imagine anything other than life.</p>\n<p>I’m not religious, but sometimes I wish I was. I was talking to a friend one time, and he asked me if I believed in heaven and I said “Fuck no” and he said that’s a pretty privileged thing to say. I remember thinking about that for a while after. How blessed am I that my life is so great I don’t need to wish for anything better after death. But still, it would be nice to know that there is something after. Hindus believe in reincarnation, and my dad, who grew up in a religious household (but who has since disavowed such beliefs), once told me that he attended a sermon with his parents where the priest said that a person will become a rat or a cockroach in his next life if he or she is not a faithful follower of God.</p>\n<p>In retrospect, my dad must have been so scared, thinking that if he wasn’t religious enough he won’t be human again in his next life. And it reminds me of another a conversation I had with a friend (the same one who asked me about heaven) who grew up in a devout Catholic household. To be a child, and to be constantly worried that if you do something bad (like lie, or cheat), you won’t just be punished, you’ll go to hell – it’s unfathomable. How can a child learn what’s right and what’s wrong if every action they ever make is under the threat that they might be condemned to eternal damnation?</p>\n","title":"No Title","date":"2021-01-07"}},"__N_SSG":true}