{"pageProps":{"postData":{"id":"on-coffee","contentHtml":"<p>I ran into a friend the other day and of course, he wasn’t a friend and of course, I wasn’t running. but that won’t matter in a second. We had met in a small art course last year and I found him exceptionally good-looking and very sweet. He is probably not very sweet, maybe just the perfectly adequate amount of sweet, but when someone is exceptionally good-looking, we tend to treat any other mildly impressive personality trait as some incredible accomplishment. So in my mind, he is very sweet.</p>\n<p>We chatted very rarely in class, and once the quarter ended and we no longer saw each other every Monday and Wednesday, we would simply smile and wave to each other across crowded bike paths and clustered dining tables. There was one time where the two of us had come late to the same dining hall, so we sat and talked for maybe an hour or so, and I remember getting a bowl of Cheerios after I had finished my lunch so I had an excuse to stay longer. He made me laugh and had a very charming personality but I never really saw him around after that and by the time summer had come, I had more or less forgotten about him.</p>\n<p>I saw him again recently while walking to my Creative Nonfiction class and he looked a little different. He had grown some facial hair and he seemed shorter for some reason, which I later realized was because I was wearing heels, but other than that he looked the same. He recognized me instantly and we hugged and he asked me about my summer. He seemed very genuinely interested in what I had to say, or maybe my mind convinced me so, and so I told him about my work and my trips and that I was so sorry and it was great to see him, but I actually was in a rush to get to class.</p>\n<p>Well, we should get coffee, he said and I found it interesting the way he said it, like it was an obvious next step, and any other suggestion would just be completely foolish. I’ll message you, he said, and I said ok, but I knew that he never would and of course he never did.</p>\n<p>It was a disappointment akin to finding a shirt you like at the store, but then seeing that there is none in your size. You see the shirt and you are hopeful and excited, but as your hands comb through the slew of disheveled hangers, you become less and less hopeful and less and less excited until you realize that there is no Small, and you were stupid to have been so excited in the first place. You’re not completely surprised, you knew it was a nice shirt and there would probably be no Smalls available, but a small part of you is, without a doubt, disappointed.</p>\n<p>When I run into him on campus again, he will probably remember our most recent conversation and tell me that he’s so, so sorry but school just started and things have been absolutely crazy recently, and I’ll smile and say that’s ok, I forgot about it too, even though I obviously hadn’t. One of us will be in a rush, I’m sure, and there will be another slightly strained hug and a smile and a wave before we both part and go about the rest of our days.</p>\n<p>“You can just text him,” J— says.\nI shake my head furiously no, because didn’t he clearly say that <em>he</em> would message <em>me</em>? Wasn’t it <em>his</em> idea to get coffee in the first place?</p>\n<p>“You are being ridiculous.”<br>\n\"I’m not.\"<br>\n“You are acting like you have no agency in this situation. Like everything is happening to you but you have no control over it.  If the two of you never get coffee, it’s also your fault because you never did anything about it.”<br>\nSilence.<br>\n“You can’t just blame him.”<br>\nSilence.<br>\n“You can do something about it too.”<br>\nSilence.<br>\n“So are you going to ask him?”<br>\nSilence.<br>\n“Are you going to text him?”<br>\nSilence.<br>\n“Amrita?”<br>\n\"No.\"<br>\n“Why not?”<br>\n\"Because I hate coffee.\"</p>\n","title":"On Coffee","date":"2018-09-27"}},"__N_SSG":true}